<?php

return [

    /*
     |
     |--------------------------------------------------------------------------
     | --- Ключ (токен) для підключення до API Gemini AI ---
     |--------------------------------------------------------------------------
     |
     | Ключ є обов'язковим, його можна отримати на офіційній сторінці від `google`
     | Official docs - https://ai.google.dev/gemini-api/docs
     |
     */
    'key' => env('GEMINI_KEY', 'AIzaSyDNDl3F-zKEcH6FBxq5YImJQH1SfH1nxiA'),

    /*
     |
     |--------------------------------------------------------------------------
     | --- URL для підключення API Gemini AI ---
     |--------------------------------------------------------------------------
     |
     | Ключ передається через `GET` параметр `key`
     | Url = https://generativelanguage.googleapis.com/v1/models/gemini-2.0-flash:generateContent?key={key}
     |
     */
    'url' => env('GEMINI_URL', 'https://generativelanguage.googleapis.com/v1/models/gemini-2.0-flash:generateContent?key={key}'),

    /*
     |
     |--------------------------------------------------------------------------
     | --- Варіант та тривалість життя чату з Gemini AI ---
     |--------------------------------------------------------------------------
     |
     | Чат зберігається в кеші, тож його можна або зберігати назавжди,
     | або дати йому тривалість у хвилинах
     |
     */
    'life' => [
        'forever' => true,
        'duration' => env('GEMINI_LIFE_DURATION', 60), # тривалість життя у хвилинах
    ],
];
