<?php

return [

    /*
     |
     |--------------------------------------------------------------------------
     | --- Ключ (токен) для підключення до телеграм бота ---
     |--------------------------------------------------------------------------
     |
     | Ключ є обов'язковим, його можна отримати в телеграм у `BotFather`
     |
     */
    'token' => env('TELEGRAM_BOT_TOKEN'),

    /*
     |
     |--------------------------------------------------------------------------
     | --- Унікальний User ID для надсилання повідомлення конкретній людині ---
     |--------------------------------------------------------------------------
     |
     | User ID є обов'язковим, його можна отримати в телеграм
     |
     */
    'user_id' => env('TELEGRAM_USER_ID'),
];
